{
  "greeting": {
    "part1": "Hi, I'm ",
    "name": "Cyril De Graeve",
    "part2": ", a Fullstack Javascript Developer, Problem solver, Freelance & Solopreneur. I look forward to working for ",
    "you": "you",
    "part3": "."
  },

  "welcome": {
    "portfolio": "WELCOME TO MY PORTFOLIO"
  },

  "menu": {
    "hardskills": "Hard skills",
    "works": "Works",
    "game": "Let's play !",
    "resume": "Resume",
    "softskills": "Soft skills",
    "contact": "Contact"
  },

  "title": {
    "hardskills": "HARD SKILLS",
    "works": "WORKS",
    "game": "LET'S PLAY !",
    "softskills": "SOFT SKILLS (& ethics)",
    "contact": "CONTACT",
    "testimonials": "Testimonials",
    "introduction": "Some feedback from customers and reviewers satisfied with my services."
  },

  "prez": {
    "part1Q": "Who I am?",
    "part1": "Cybercultural journalist in a previous life, always passionate about machines and networks, I now work as a freelance developer full of projects and new contacts.",
    "part3Q": "Why me?",
    "part3": "You have a problem? I have the solution! As a freelance developer, I offer a comprehensive range of web development services that encompass all stages of website, SaaS or application creation. My practical experience and deep understanding of the Javascript ecosystem (ES6+) enables me to solve complex problems, creating functional solutions with modern, aesthetically pleasing interfaces that are tailored to your needs."
  },

  "hardskills": {
    "scrum": "Agile / Scrum",
    "method": "(methods)"
  },

  "artificiallifecoach": {
    "role": "Fullstack freelance",
    "description": "I designed from scratch (Back and Front) Artificial Life Coach, an application which aims to offer the user an artificial life coach to manage their weekly (or daily on smartphone) interactive mobile agenda, based on their current interests and needs. After registration or connection, the user can:<br><br>> Enter their interests (1 or more) and current needs for a duration (in days) that they determine,<br>> Send their selection directly to the coach, now able to add glitter to his life.<br>> Ask the coach: what to do this afternoon? Or tomorrow morning?,<br>> Add the coach's suggestion to his calendar, on the day and time that suits.<br>> Use the calendar by entering elsewhere its own programs and activities (Google Calendar style).<br><br>The Front server corresponds with a RESTful API, a PosgreSQL database and an OpenAI API (gpt-3.5-turbo-1106, precisely)."
  },

  "telegraphe": {
    "role": "Freelance fullstack developer",
    "description": "I created Télégraphe, a platform dedicated to discovering the shops of the Télégraphe district, located in the 20th arrondissement of Paris. Purpose: to help residents and visitors easily find local shops and learn more about what they offer.<br><br>Community members can:<br><br>> Authenticate, <br>> Discover the rating and opinions left by others,<br>> Write and save their own opinion on a store,<br>> View its exact location on an interactive map (Google Map API).<br><br>The application is fully responsive and adapts to all types of devices (desktop computers, tablets or smartphones).<br>This project is currently in progress. Additional updates and features will be added soon."
  },

  "cynoche": {
    "role": "Personnal project",
    "description": "CyNoche is a web application that lists (almost) all the movies I've seen in my life. I made this application with React and Chakra UI, and I use an API to provide data.<br><br>Features:<br><br>> Display of a catalog of films,<br>> Star rating system (out of 5), <br>> Sorting by film names, director names, release years and ratings ,<br>> Adding and/or updating and/or deleting a film from the database,<br>> Searching for films by titles and/or directors,<br>> Selection of the film profile (poster + summary),<br>> Summaries in English or French,<br>> Dark or light mode,<br>> Logging of additions, modifications and deletions (Winston).<br><br>You can use my data (over 2200 films) or yours if you fill the database with your own films."
  },

  "jadopte": {
    "role": "Product Owner & Dev Back-end",
    "description": "At the end of my training, I participated as Product Owner and Back-end Developer in the design of J'adopte un humain, a responsive design application of a fictitious animal shelter which allows future adopters to choose the companion best suited to their desires, values ​​and needs. Through this project, the aim is to dust off existing showcase sites, which are rather faded and without major interactions, and to provide shelters with a simplified and secure animal management system.<br><br>> The main idea is a matching system between the profile provided by the user when connecting and the profile of the animals provided by the caregivers (staff).<br><br>> The site has 3 levels of rights (roles and permissions): User profile / Staff profile / Admin profile, authenticated (JSON Web Token) and secure (BCrypt)."
  },

  "donefficace": {
    "role": "Dev Front-end & Back-end",
    "description": "I participated in the internationalization (with the 'i18next' framework) of the site of the Giving What We Can association to create the French version of the new site of Don Efficace, a non-profit NGO intended to finance actions for reduce the suffering of all sentient beings (human and non-human) as effectively as possible, directly or indirectly.<br><br>I also updated the marketing portion of the site using Sanity, an open-source headless CMS written in JavaScript and designed for developers<br><br>Finally, I took care of the necessary adaptations so that the site was fully GDPR compliant. A 2-month project carried out as a team and in close collaboration with Swiss-German and English developers."
  },

  "portfolio": {
    "title": "My portfolio",
    "role": "Problem solver / At your service",
    "description": "The portfolio that you are currently browsing, in constant evolution, can be viewed in dark or light mode, on desktop or on smartphone, depending on your preferences. You can read it in French or English.<br><br>I am delighted to present here some of my creations, and to introduce you to new ones soon... I will be very happy to be able to add your project which could well be the most exceptional of all. Your vision combined with my expertise could give birth to something unique. I am attentive to your needs and ready to collaborate to transform your ideas into reality.<br><br>Let's discuss it and find together the best solution for your aspirations."
  },

  "yourproject": {
    "title": "Your project ?",
    "role": "Problem solver / At your service",
    "description": "This project is still in the realm of imagination, and it might just be the most exceptional one yet. Your vision combined with my expertise could create something truly unique. I'm attuned to your needs and stand ready to collaborate, turning your ideas into reality. Let's discuss and find the best solutions together to fulfill your aspirations."
  },

  "testimonial1": {
    "name": "Alejandrina Cristia",
    "role": "President of the Don Efficace endowment fund",
    "message": "Cyril, who was very open to feedback, well organized and autonomous, is a pleasant person to work with. We highly recommend him and will work with him again in the future."
  },

  "testimonial2": {
    "name": "Karine",
    "role": "Head of La Meute heureuse association",
    "message": "What impressed me the most was Cyril's ability to understand my needs: his attention to detail, his responsiveness and his expertise make him a talented and available professional."
  },

  "testimonial3": {
    "name": "The jury",
    "role": "Professional title Web & Mobile Web Developer",
    "message": "Congrats Cyril on obtaining your professional title! You have shown good maturity as a developer and you have the soft skills necessary to succeed as a freelancer."
  },

  "game": {
    "message": "I am also interested in AI, machine & deep learning. My skills in this area are still elementary, but my interest and curiosity are strong. Here is a Morpion that I coded, for fun, with the minimax algorithm, a basic and deterministic AI. If you manage to beat the machine, I'm offering the first 2 days of service! ;-)",
    "win": "You win !",
    "fail": "You lose",
    "draw": "Draw",
    "reset": "Reset game"
  },

  "softskill1": {
    "skill": "WRITING SKILLS",
    "description": "Great editorial skills, for editing, writing and rewriting (French and English) / Graduate diploma in journalism.",
    "example": "For 20 years, I was a journalist (GQ, Paris-Match...). I also founded a cybercultural magazine on the Internet and on newsstands, of which I was the editorial director (40 journalists) and editor-in-chief for more than 15 years."
  },

  "softskill2": {
    "skill": "INDIVIDUAL INITIATIVE & AUTONOMY",
    "description": "Independent and autonomous worker, I know how to manage projects that require important creative and functional initiatives.",
    "example": "To best meet the needs defined upstream with my clients, I demonstrate autonomy in the execution of creative and innovative missions, anticipating both the constraints and possibilities of a project with high added value."
  },

  "softskill3": {
    "skill": "TREND MONITORING",
    "description": "Ability to observe and analyze the latest cultural, societal and technological trends.",
    "example": "I strive to capture the interests of a young and connected audience by unearthing cutting-edge content and techniques, the result of constant monitoring of trends to be and act in signs of the times."
  },

  "softskill4": {
    "skill": "SOCIAL NETWORKS & WEB 3",
    "description": "Excellent command of social networks and good understanding of the dynamics of the Web 3.",
    "example": "I know how to optimize an online presence, with a strategic use of social networks, while keeping myself actively informed of Web 3 developments, in order to improve the engagement and the reach of the public."
  },

  "softskill5": {
    "skill": "FLEXIBLE & AVAILABLE",
    "description": "High flexibility and availability, adept at remote work and unconventional work hours.",
    "example": "I easily manage projects remotely and in different time zones, constantly providing my partners with a follow-up of my achievements and the convincing results."
  },

  "softskill6": {
    "skill": "GEEK CULTURE & VIDEO GAMES",
    "description": "Cinephile, gamer and cyberpunk fan. Deeply immersed in digital cultures since the early 1990s.",
    "example": "I knew and used a wide variety of game consoles, open worlds, computers (Apple IIe, Amstrad, Atari ST, Amiga, Mac, PC...). This passion fueled my immersion in digital cultures, allowing me to understand and adapt to emerging trends."
  },

  "softskill7": {
    "skill": "ANIMALS / MACHINES",
    "description": "Passionate about technology with a deep love for animals, cherishing both innovation and living things.",
    "example": "Living with two human companions and a dog, I long for a future filled with advanced technology and diverse pets. As a vegan and antispeciesist human, I respect all forms of life, whether animal, plant or digital."
  },

  "softskill8": {
    "skill": "STRENGHTS & WEAKNESSES",
    "description": "Dedicated, meticulous, punctual, curious, attentive, open-minded and mature. Humble, I welcome my (human) imperfections with serenity.",
    "example": "I demonstrate integrity and reliability, consistently demonstrated in professional circles. Not without gap, but constantly striving to learn and improve my skills."
  },

  "contact": {
    "leavemessage": "Ready to build something amazing together? Please leave a message so I can understand your website, SaaS and application (web & mobile) creation, redesign and optimization needs, both front-end and back-end. I also invite you to visit my spaces on social networks, as well as my profile on market platforms like Malt or Codeur, where I offer my services.",
    "formname": "Name",
    "formorganisation": "Organisation",
    "formemail": "Email address",
    "formmessage": "Message",
    "formsubmit": "Submit"
  },

  "resume": {
    "cv": "Download CV"
  },

  "mobilemenu": {
    "hardskills": "Hard skills",
    "works": "Works",
    "game": "Let's play !",
    "resume": "Resume",
    "softskills": "Soft skills",
    "contact": "Contact",
    "dark": "Select dark mode",
    "light": "Select light mode",
    "switchfr": "Select to French",
    "switchen": "Select to English"
  }
}
