{
    "greeting": {
      "part1": "Hi, I'm ",
      "name": "Cyril De Graeve",
      "part2": ", a freelance Fullstack Javascript Developer, and I look forward to working for ",
      "you": "you",
      "part3": "."
    },

    "welcome": {
      "portfolio": "WELCOME TO MY PORTFOLIO"
    },

    "menu": {
      "hardskills": "Hard skills",
      "works": "Works",
      "game": "Let's play !",
      "resume": "Resume",
      "softskills": "Soft skills",
      "contact": "Contact"
    },

    "title": {
      "hardskills": "HARD SKILLS",
      "works": "WORKS",
      "game": "LET'S PLAY !",
      "softskills": "SOFT SKILLS (& ethics)",
      "contact": "CONTACT"
    },

    "prez": {
      "part1": "Once a cybercultural journalist with a lifelong passion for machines and networks, I transitioned into web development after completing an intensive training course in both front and back-end Javascript. This training allowed me to acquire solid technical skills and earn the",
      "part2": "Professional Title of Web & Mobile Web Developer",
      "part3": "Now, as a freelance developer, I offer a comprehensive range of web development services that encompass all stages of website and/or web application creation. My practical experience and deep understanding of the incredible Javascript ecosystem enables me to solve complex problems, creating functional solutions with modern, aesthetically pleasing interfaces that are tailored to your needs."
    },

    "cynoche": {
      "role": "Personnal project",
      "description": "CyNoche is a web app that lists (almost) every movie I've seen in my life. The app is made with React and Chakra UI, and it uses an API to provide data (movies, ratings, directors, release years, posters, and summaries). Features: Viewing a catalog of movies / Star rating system (out of 5) / Sorting by movie names, director names, release years and ratings / Adding and/or updating and/or deleting a film from the database / Search for films by title and/or director / Selection of a film's file (poster + summary) / Summaries in English or French / Dark or light mode / Logging (Winston). You can use my data (about 2000 films) or yours if you fill the database with your own movies."
    },

    "jadopte": {
      "role": "Product Owner & Dev Back-end",
      "description": "Responsive design application of a fictional animal shelter that allows future adopters to choose the companion best suited to their desires, values and needs. Through this project, it is a question of dusting off the existing showcase sites, which are rather bland and without major interactions, and to provide shelters with a simplified and secure animal management system. The main idea of J'Adopte un humain is based on a matching system between the profile entered by the user during his connection and the profile of the animals entered by the caregivers (staff)."
    },

    "donefficace": {
      "role": "Dev Front-end & Back-end",
      "description": "I participated in the internationalization (with the 'i18next' framework) of the website of the Giving What We Can association to create the French version of the new site of Don Efficace, a non-profit NGO intended to finance actions for reduce the suffering of all sentient beings (human and non-human) as effectively as possible, directly or indirectly. I also updated the marketing part of the site using Sanity, an open-source headless CMS written in JavaScript and designed for developers."
    },

    "portfolio": {
      "title": "My portfolio",
      "role": "Personnal project",
      "description": "The ever-changing portfolio you are currently browsing can be viewed in dark or light mode, on desktop or smartphone, depending on your preference. You can read it in French or in English. I am delighted to present here some of my achievements, and to make you discover new ones soon..."
    },

    "game": {
      "message": "I am also interested in AI, machine & deep learning. My skills in this area are still elementary, but my interest and curiosity are strong. Here is a Morpion that I coded, for fun, with the minimax algorithm, a basic and deterministic AI. If you manage to beat the machine, I offer you my first 2 days of service! ;-)",
      "win": "You win !",
      "fail": "You lose",
      "draw": "Draw",
      "reset": "Reset game"
    },


    "softskill1": {
      "skill": "WRITING SKILLS",
      "description": "Great editorial skills, for editing, writing and rewriting (French and English) / Graduate diploma in journalism.",
      "example": "For 20 years, I was a journalist (GQ, Paris-Match...). I also founded a cybercultural magazine on the Internet and on newsstands, of which I was the editorial director (40 journalists) and editor-in-chief for more than 15 years."
    },

    "softskill2": {
      "skill": "INDIVIDUAL INITIATIVE & AUTONOMY",
      "description": "Independent and autonomous worker, I know how to manage projects that require important creative and functional initiatives.",
      "example": "To best meet the needs defined upstream with my clients, I demonstrate autonomy in the execution of creative and innovative missions, anticipating both the constraints and possibilities of a project with high added value."
    },

    "softskill3": {
      "skill": "TREND MONITORING",
      "description": "Ability to observe and analyze the latest cultural, societal and technological trends.",
      "example": "I strive to capture the interests of a young and connected audience by unearthing cutting-edge content and techniques, the result of constant monitoring of trends to be and act in signs of the times."
    },

    "softskill4": {
      "skill": "SOCIAL NETWORKS & WEB 3",
      "description": "Excellent command of social networks and good understanding of the dynamics of the Web 3.",
      "example": "I know how to optimize an online presence, with a strategic use of social networks, while keeping myself actively informed of Web 3 developments, in order to improve the engagement and the reach of the public."
    },

    "softskill5": {
      "skill": "FLEXIBLE & AVAILABLE",
      "description": "High flexibility and availability, adept at remote work and unconventional work hours.",
      "example": "I easily manage projects remotely and in different time zones, constantly providing my partners with a follow-up of my achievements and the convincing results."
    },

    "softskill6": {
      "skill": "GEEK CULTURE & VIDEO GAMES",
      "description": "Cinephile, gamer and cyberpunk fan. Deeply immersed in digital cultures since the early 1990s.",
      "example": "I knew and used a wide variety of game consoles, open worlds, computers (Apple IIe, Amstrad, Atari ST, Amiga, Mac, PC...). This passion fueled my immersion in digital cultures, allowing me to understand and adapt to emerging trends."
    },

    "softskill7": {
      "skill": "ANIMALS / MACHINES",
      "description": "Passionate about technology with a deep love for animals, cherishing both innovation and living things.",
      "example": "Living with two human companions and a dog, I long for a future filled with advanced technology and diverse pets. As a vegan and antispeciesist human, I respect all forms of life, whether animal, plant or digital."
    },

    "softskill8": {
      "skill": "STRENGHTS & WEAKNESSES",
      "description": "Dedicated, meticulous, punctual, curious, attentive, open-minded and mature. Humble, I welcome my (human) imperfections with serenity.",
      "example": "I demonstrate integrity and reliability, consistently demonstrated in professional circles. Not without error and shortcoming, but constantly striving to learn and improve my skills."
    },

    "contact": {
      "leavemessage": "Ready to build something amazing together? Please leave a message so I can understand your website and mobile application creation, redesign and optimization needs, both front-end and back-end. I also invite you to visit my spaces on social networks, as well as my profile on market platforms like Malt, where I offer my services.",
      "formname": "Name",
      "formorganisation": "Organisation",
      "formemail": "Email address",
      "formmessage": "Message",
      "formsubmit": "Submit"
    },

    "resume": {
      "cv": "Download CV"
    },

    "mobilemenu": {
      "hardskills": "Hard skills",
      "works": "Works",
      "game": "Let's play !",
      "resume": "Resume",
      "softskills": "Soft skills",
      "contact": "Contact",
      "dark": "Select dark mode",
      "light": "Select light mode",
      "switchfr": "Select to French",
      "switchen": "Select to English"
    }
}