{
  "greeting": {
    "part1": "Hello, je suis ",
    "name": "Cyril De Graeve",
    "part2": ", développeur Javascript Fullstack, Problem solver, Freelance et Solopreneur. J'ai hâte de travailler pour ",
    "you": "vous",
    "part3": "."
  },

  "welcome": {
    "portfolio": "BIENVENUE DANS MON PORTFOLIO"
  },

  "menu": {
    "hardskills": "Hard skills",
    "works": "Projets",
    "game": "Let's play !",
    "resume": "Mon CV",
    "softskills": "Soft skills",
    "contact": "Contact"
  },

  "title": {
    "hardskills": "HARD SKILLS",
    "works": "PROJETS",
    "game": "LET'S PLAY !",
    "softskills": "SOFT SKILLS  (et valeurs)",
    "contact": "CONTACT",
    "testimonials": "C'est vous qui le dites !",
    "introduction": "Quelques retours de clients et examinateurs satisfaites par mes services."
  },

  "prez": {
    "part1Q": "Qui je suis ?",
    "part1": "Journaliste cyberculturel dans une vie antérieure, passionné par les machines et les réseaux depuis toujours, j'exerce aujourd'hui une activité de développeur freelance riche de projets et de nouveaux contacts.",
    "part3Q": "Pourquoi moi ?",
    "part3": "Vous avez un problème ? J'ai la solution ! En tant que développeur freelance, je propose une gamme de services de développement web qui couvrent toutes les étapes du processus de création d'un site, d'un SaaS ou d'une application. Grâce à ma pratique et mes connaissances de l'écosystème Javascript (ES6+), je suis en mesure de résoudre des problèmes complexes en créant des solutions fonctionnelles et des interfaces esthétiques modernes adaptées à vos besoins."
  },

  "hardskills": {
    "scrum": "Agile / Scrum",
    "method": "(méthodes)"
  },

  "artificiallifecoach": {
    "role": "Fullstack freelance",
    "description": "J'ai conçu de A à Z (Back et Front) Artificial Life Coach, une application qui vise à offrir à l'utilisateur un coach de vie artificiel pour gérer son agenda mobile interactif hebdomadaire (ou quotidien sur smartphone), en fonction de ses intérêts et besoins actuels. Après inscription ou connection, le user peut :<br><br>> Saisir ses centres d'intérêt (1 ou plus) et se besoins actuels pour une durée (en jours) qu'il vous détermine,<br>> Transmettre sa sélection directement au coach, en capacité dorénavant d'ajouter des paillettes dans sa vie.<br>> Questionner le coach : quoi faire cet après-midi ? Ou demain matin ?,<br>> Ajouter la suggestion du coach à son agenda, au jour et à l'heure qui lui conviennent.<br>> Utiliser le calendrier en saisissant par ailleurs ses propres programmes et activités (façon Google Agenda).<br><br>Le serveur Front correspond avec une API RESTful, une base de données PosgreSQL et une API OpenAI (gpt-3.5-turbo-1106, précisément)."
  },

  "telegraphe": {
    "role": "Fullstack freelance",
    "description": "J'ai créé Télégraphe, une plateforme dédiée à la découverte des boutiques du quartier Télégraphe, situé dans le 20ème arrondissement de Paris. Objectif : aider les résidents et les visiteurs à trouver facilement des boutiques locales et à en savoir plus sur ce qu'elles offrent.<br><br>Les membres de la communauté peuvent :<br><br>> S'authentifier,<br>> Découvrir la note et les avis laissés par les autres,<br>> Rédiger et enregistrer leur propre avis sur une boutique,<br>> Visualiser son emplacement exact sur une carte interactive (Google Map API).<br><br>L'application est totalement responsive et s'adapte à tous les types d'appareils (desktops, tablettes ou smartphones).<br>Ce projet est actuellement en phase de développement. Des mises à jour et des fonctionnalités supplémentaires seront ajoutées prochainement."
  },

  "cynoche": {
    "role": "Projet personnel",
    "description": "CyNoche est une application web qui répertorie (presque) tous les films que j'ai vus dans ma vie. J4ai réalisé cette application avec React et Chakra UI, et j'utilise une API pour fournir des données.<br><br>Fonctionnalités :<br><br>> Affichage d'un catalogue de films,<br>> Système de classement par étoiles (sur 5), <br>> Tri par noms de films, noms de réalisateurs, années de sortie et notes,<br>> Ajout et/ou mise à jour et/ou suppression d'un film de la base de données,<br>> Recherche des films par titres et/ou réalisateurs,<br>> Sélection de la fiche d'un film (affiche + pitch),<br>> Résumés en anglais ou français,<br>> Dark ou light mode,<br>> Journalisation des ajouts, modifications et suppression (Winston).<br><br>Vous pouvez utiliser mes données (plus de 2200 films) ou les vôtres si vous remplissez la base de données avec vos propres films."
  },

  "jadopte": {
    "role": "Product Owner & Dev Back-end",
    "description": "Á la fin de ma formation, j'ai participé en tant que Product Owner et Développeur Back-end à la conception de J'adopte un humain, application responsive design d'un refuge fictif pour animaux qui permet aux futurs adoptants de choisir le compagnon le mieux adapté à leurs envies, valeurs et besoins. À travers ce projet, il s'agit de dépoussiérer les sites vitrines existants, plutôt fades et sans grandes interactions, et de fournir aux refuges un système de gestion des animaux simplifié et sécurisé.<br><br>> L'idée maîtresse repose sur un un système de matching entre le profil renseigné par l'utilisateur durant sa connexion et le profil des animaux renseignés par les soignants (staff).<br><br>> Le site comporte 3 niveaux de droits (des rôles et des permissions) : profil User / profil Staff / profil Admin, authentifié (JSON Web Token) et sécurisé (BCrypt)."
  },

  "donefficace": {
    "role": "Dev Front-end & Back-end",
    "description": "J'ai participé à l'internationalisation (avec le framework 'i18next') du site de l'association Giving What We Can pour créer la version française du nouveau site de Don Efficace, une ONG à but non lucratif destinée à financer des actions pour réduire la souffrance de tous les êtres sensibles (humains et non-humain) aussi efficacement que possible, directement ou indirectement.<br><br>J'ai également mis à jour la partie marketing du site en utilisant Sanity, un CMS open-source headless écrit en JavaScript et conçu pour les développeurs.<br><br>Enfin, je me suis chargé des adaptations nécessaires pour que le site soit totalement en conformité RGPD. Un travail de 2 mois réalisé en équipe et étroite collaboration avec des développeurs Suisse-allemands et anglais."
  },

  "portfolio": {
    "title": "Mon portfolio",
    "role": "Problem solver / À votre service",
    "description": "Le portfolio que vous parcourez actuellement, en constante évolution, peut être visualisé en dark ou light mode, sur ordinateur de bureau ou sur smartphone, selon vos préférences. Vous pouvez le lire en français ou en anglais.<br><br>Je suis ravi de présenter ici quelques-unes de mes réalisations, et de vous en faire découvrir des nouvelles prochainement... Je serai très heureux de pouvoir y ajouter votre projet qui pourrait bien être le plus exceptionnel de tous. Votre vision alliée à mon expertise pourrait donner naissance à quelque chose d'unique. Je suis à l'écoute de vos besoins et prêt à collaborer afin de transformer vos idées en réalité.<br><br>Discutons-en et trouvons ensemble la meilleure solution pour vos aspirations."
  },

  "yourproject": {
    "title": "Votre projet ?",
    "role": "Problem solver / À votre service",
    "description": "Ce projet est encore à imaginer, et il pourrait bien être le plus exceptionnel de tous. Votre vision alliée à mon expertise pourrait donner naissance à quelque chose d'unique. Je suis à l'écoute de vos besoins et prêt à collaborer afin de transformer vos idées en réalité. Discutons-en et trouvons ensemble la meilleure solution pour vos aspirations."
  },

  "testimonial1": {
    "name": "Alejandrina Cristia",
    "role": "Présidente du fonds de dotation Don Efficace",
    "message": "Cyril, qui s'est montré très ouvert au feedback, bien organisé et autonome, est une personne avec laquelle il est agréable de travailler. Nous le recommandons vivement et nous travaillerons de nouveau avec lui à l'avenir."
  },

  "testimonial2": {
    "name": "Karine",
    "role": "Responsable de l'association La Meute heureuse",
    "message": "Ce qui m'a le plus impressionnée, c'est la capacité de Cyril à comprendre mes besoins : son souci du détail, sa réactivité et son expertise font de lui un pro talentueux et disponible."
  },

  "testimonial3": {
    "name": "Le jury",
    "role": "Titre professionnel Développeur Web & Web Mobile",
    "message": "Félicitations Cyril, pour l’obtention de ton Titre professionnel ! Tu as montré une bonne maturité en tant que développeur et tu as les soft skills nécessaires pour réussir en tant que freelance."
  },

  "game": {
    "message": "Je m'intéresse également à l'IA, au machine & deep learning. Mes compétences en la matière sont encore élémentaires, mais mon intérêt et ma curiosité sont puissants. Voici un Morpion que j'ai codé, pour le fun, avec l'algorithme minimax, une IA basique et déterministe. Si vous parvenez à battre la machine, j'offre les 2 premières journées de prestation ! ;-)",
    "win": "Gagné !",
    "fail": "Perdu",
    "draw": "Égalité",
    "reset": "Recommencez"
  },

  "softskill1": {
    "skill": "COMPÉTENCES RÉDACTIONNELLES",
    "description": "Grandes compétences éditoriales, pour de l'édition, de la rédaction et de la réécriture (français et anglais) / Diplôme d'études supérieures en journalisme.",
    "example": "Pendant 20 ans, j'ai été journaliste (GQ, Paris-Match...). J'ai également fondé un magazine cyberculturel sur Internet et en kiosque, dont j'ai été le directeur de la rédaction (40 journalistes) et rédacteur en chef pendant plus de 15 ans."
  },

  "softskill2": {
    "skill": "ESPRIT D'INITIATIVE ET AUTONOMIE",
    "description": "Travailleur indépendant et autonome, je sais gérer des projets qui nécessitent des prises d'initiative créatives et fontionnelles importantes.",
    "example": "Pour répondre au mieux à des besoins définis en amont avec mes clients, je fais preuve d'autonomie dans l'exécution de missions créatives et innovantes, en anticipant à la fois les contraintes et possibilités d'un projet à forte valeur ajoutée."
  },

  "softskill3": {
    "skill": "SUIVI DES TENDANCES",
    "description": "Capacité d'observation et d'analyse des dernières tendances culturelles, sociétales et technologiques.",
    "example": "Je m'évertue à capter les intérêts d'un public jeune et connecté en dénichant des contenus et des techniques de pointe, résultat d'une surveillance parmanente des tendances pour être et agir dans l'air du temps."
  },

  "softskill4": {
    "skill": "RÉSEAUX SOCIAUX ET WEB 3",
    "description": "Excellente maîtrise des réseaux sociaux et bonne compréhension de la dynamique du Web 3.",
    "example": "Je sais optimiser une présence en ligne, avec une utilisation stratégique des réseaux sociaux, tout en me tenant activement informé des développements du Web 3, afin d'améliorer l'engagement et la portée du public."
  },

  "softskill5": {
    "skill": "FLEXIBLE ET DISPONIBLE",
    "description": "Grande flexibilité et disponibilité, adepte du télétravail et des horaires atypiques.",
    "example": "Je gère sans difficulté des projets à distance et sur différents fuseaux horaires, en fournissant constamment à mes partenaires un suivi de mes réalisations et des résultats probants."
  },

  "softskill6": {
    "skill": "CULTURE GEEK ET JEUX VIDÉO",
    "description": "Cinéphile, gamer et fan de cyberpunk. Profondément immergé dans les cultures numériques depuis le début des années 1990.",
    "example": "J'ai connu et utilisé une grande variété de consoles de jeu, de mondes ouverts, d'ordinateurs (Apple IIe, Amstrad, Atari ST, Amiga, Mac, PC...). Cette passion a alimenté mon immersion dans les cultures numériques, en me permettant de comprendre et de m'adapter aux tendances émergentes."
  },

  "softskill7": {
    "skill": "ANIMAUX / MACHINES",
    "description": "Passionné de technologie avec un profond amour pour les animaux, chérissant à la fois l'innovation et les êtres vivants.",
    "example": "Vivant avec deux compagnons humains et une chienne, j'aspire à un avenir rempli de technologies de pointe et d'animaux de compagnie diversifiés. En tant qu'humain vegan et antispéciste, je respecte toutes les formes de vie, qu'elles soient animales, végétales ou numériques."
  },

  "softskill8": {
    "skill": "FORCES ET FAIBLESSES",
    "description": "Dévoué, minutieux, ponctuel, curieux, à l'écoute, ouvert d'esprit et mature. Humble, j'accueille avec sérénité mes imperfections (d'humain).",
    "example": "Je fais preuve d'intégrité et de fiabilité, constamment démontrées dans les milieux professionnels. Non sans lacune, mais en m'efforcant constamment d'apprendre et de booster mes compétences."
  },

  "contact": {
    "leavemessage": "On travaille ensemble ? Veuillez laisser un message afin que je puisse comprendre vos besoins en matière de création, de refonte et d'optimisation de sites, de SaaS et d'applications (web et mobile), tant en front-end qu'en back-end. Je vous invite également à visiter mes espaces sur les réseaux sociaux, ainsi que mon profil sur des plateformes de marché comme Malt ou Codeur, où je propose mes services.",
    "formname": "Votre nom",
    "formorganisation": "Organisation",
    "formemail": "Votre adresse email",
    "formmessage": "Votre message",
    "formsubmit": "Soumettre"
  },

  "resume": {
    "cv": "Téléchargez CV"
  },

  "mobilemenu": {
    "hardskills": "Hard skills",
    "works": "Projets",
    "game": "Let's play !",
    "resume": "Mon CV",
    "softskills": "Soft skills",
    "contact": "Contact",
    "dark": "Choisir dark mode",
    "light": "Choisir light mode",
    "switchfr": "Choisir le français",
    "switchen": "Choisir l'anglais"
  }
}
